piconomix/px-fwlib/libs/ATmega_DFP/Atmel.ATmega_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.ATMEL.xsd">
   <vendor>Atmel</vendor>
   <url>http://packs.download.atmel.com/</url>
   <name>ATmega_DFP</name>
   <description>Atmel ATmega Series Device Support</description>
   <releases>
      <release version="1.7.374" date="2021-07-13">Added TOSC32K option to RTC.CLKSEL and bitfields to CCL TRUTH registers for ATmega4809/4808/3209/3208/1609/1608/809/808.</release>
      <release version="1.6.364" date="2020-10-30">Added PAGE_SIZE for memories in several assembler include files. Updated conditions in .pdsc for XC8 compiler.</release>
      <release version="1.5.362" date="2020-08-31">Corrected MAPPED_ROGMEM rw-attribute for AVR8X devices. Added XC8 support files. Updated copyright notice in c-header files. Corrected numbering of PORTMUX EVOUT from numbers to letters for ATmega4809/4808/3209/3208/1609/1608/809/808.</release>
      <release version="1.4.351" date="2020-03-16">Add DIDR0.AD6D and DIDR0.ADC7D bits to ATMega328PB. Corrected CORE_VERSION for AVR8X devices. Added LOCKBITS_DEFAULT for AVR8X devices.</release>
      <release version="1.4.346" date="2019-12-20">Set interrupt vector size for ATmega809/808 to 4 bytes. Corrected data memory size.</release>
      <release version="1.4.331" date="2019-10-16">Corrected interrupt, EVSYS value names and fuse values in header for ATmega4809/4808/3209/3208/1609/1608/809/808. In assembly include files list addresses with HEX and corrected interrupt vector offsets. Corrected AC.SFIOR.PSR2 for ATmega32A. Added support for pseudo ISR instruction in avr8-gcc. Group adjacent reserved bytes in arrays in the header files.</release>
      <release version="1.3.300" date="2018-11-27">Corrected various caption typos. Corrected TCA0 event names for ATmega4809/4808/3209/3208/1609/1608/809/808. Added linker scripts for ATmega809. Added signals to ATmega-C-devices. Refactored away family header files, now there is one header file per device.</release>
      <release version="1.2.272" date="2018-09-17">Corrected CLKCTRL signals, ALT out signals and interrupt edge triggering values for CCL and added SEQCTRL1 for ATmega4809, ATmega4808, ATmega3209 and ATmega3208. Corrected RW status on MCLKSTATUS register. Corrected TWI0 pins on mega324PB. Added ATmega1609, ATmega1608, ATmega809 and ATmega808. Corrected flash pagesizes in m64HVE2def.inc, m644RFR2def.inc, m1284RFR2def.inc, m88PBdef.inc, m324PBdef.inc, m2564RFR2def.inc, m168PBdef.inc and m328PBdef.inc. Size defines have been made unsigned in some headerfiles. Corrected variants, port signals, value-groups and pinout for various devices</release>
      <release version="1.2.209" date="2018-02-19">Corrected reset pin configurations and changed PORTMUX signal names for ATmega4809, ATmega4808, ATmega3209 and ATmega3208. Corrected TWI0 pins on mega324PB.</release>
      <release version="1.2.203" date="2017-12-15">Corrected register names for ATmega4809, ATmega4808, ATmega3209 and ATmega3208.</release>
      <release version="1.2.150" date="2017-09-27">Remove no-ascii characters from iomxx4.h. Added ATmega4809, ATmega4808, ATmega3209 and ATmega3208.</release>
      <release version="1.2.132" date="2016-12-14">Fix ACSRB location for ATmega44/88/168/328PB. Fix sleep mode values for ATmega16/16A. Update signals info for ATmega324/328PB. Update ADC MUX config values for most devices.</release>
      <release version="1.1.130" date="2016-09-18">Fix bitfields of PRR registers for PWM devices. Remove XDIV in ATmega128. Update CFD fuse for ATmega328PB.</release>
      <release version="1.0.118" date="2016-06-17">Update ATDF files with various information required for support in Start.</release>
      <release version="1.0.106" date="2016-04-25">Fix bitfield and register name issues for all 'Timer/Counter, 16-bit' for ATmega324PB.</release>
      <release version="1.0.105" date="2016-04-13">Add PCINT[0,7] to ATmega2564 IO header.</release>
      <release version="1.0.98" date="2016-02-18">Removed Full-Swing Crystal field for SUT_CKSEL of ATmega PB devices. Updated documentation links.</release>
      <release version="1.0.91" date="2015-11-13">Initial release.</release>
      <release version="1.0.90" date="2015-09-25">Preview.</release>
   </releases>
   <keywords>
      <keyword>Atmel</keyword>
      <keyword>Device Family Package Atmel</keyword>
      <keyword>Device Support</keyword>
      <keyword>ATmega</keyword>
   </keywords>
   <devices>
      <family Dfamily="ATmega" Dvendor="Atmel:3">
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                            schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
               <mchp:prerequisite component="MPLAB X IPE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="AT90CAN128">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iocan128.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/AT90CAN128.atdf"/>
                  <at:variant ordercode="AT90CAN128-16AI"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="AT90CAN128-16MI"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="AT90CAN128-16AU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="AT90CAN128-16MU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory start="0x0000"
                             size="0x20000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1fc00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1f800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1f000"
                             size="0x1000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1e000"
                             size="0x2000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x1000"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory name="XRAM"
                             start="0x1100"
                             size="0xef00"
                             type="ram"
                             external="true"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x1000"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x08"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="megajtag" name="JTAG"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="at90can128"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 128KB Flash, 64-pin, CAN Controller</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=AT90CAN128"
                  title="Device page for AT90CAN128"/>
            <book name="https://www.microchip.com/wwwproducts/productds/AT90CAN128"
                  title="Datasheet"/>
         </device>
         <device Dname="AT90CAN32">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iocan32.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/AT90CAN32.atdf"/>
                  <at:variant ordercode="AT90CAN32-16AI"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="AT90CAN32-16MI"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="AT90CAN32-16AU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="AT90CAN32-16MU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory start="0x0000"
                             size="0x8000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x7c00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x7800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x7000"
                             size="0x1000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x6000"
                             size="0x2000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x0800"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory name="XRAM"
                             start="0x0900"
                             size="0xf700"
                             type="ram"
                             external="true"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0400"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x08"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="megajtag" name="JTAG"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="at90can32"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 32KB Flash, 64-pin, CAN Controller</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=AT90CAN32"
                  title="Device page for AT90CAN32"/>
            <book name="https://www.microchip.com/wwwproducts/productds/AT90CAN32"
                  title="Datasheet"/>
         </device>
