piconomix/px-fwlib/libs/ATmega_DFP/Atmel.ATmega_DFP.pdsc
         <device Dname="AT90PWM81">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/io90pwm81.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/AT90PWM81.atdf"/>
                  <at:variant ordercode="standard"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="0"
                              tempmax="0"/>
                  <at:memory start="0x0000"
                             size="0x2000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1f00"
                             size="0x0100"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1e00"
                             size="0x0200"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1c00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x0100"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0200"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x04"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="dw" name="debugWIRE"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="at90pwm81"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 8KB Flash, 20/32-pin, Lighting</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=AT90PWM81"
                  title="Device page for AT90PWM81"/>
            <book name="https://www.microchip.com/wwwproducts/productds/AT90PWM81"
                  title="Datasheet"/>
         </device>
         <device Dname="AT90USB1286">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iousb1286.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/AT90USB1286.atdf"/>
                  <at:variant ordercode="standard"
                              vccmin="2.2"
                              vccmax="5.5"
                              tempmin="0"
                              tempmax="0"/>
                  <at:memory start="0x0000"
                             size="0x20000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1fc00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1f800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1f000"
                             size="0x1000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1e000"
                             size="0x2000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x2000"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory name="XRAM"
                             start="0x2200"
                             size="0xde00"
                             type="ram"
                             external="true"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x1000"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x08"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="megajtag" name="JTAG"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.megadfu"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="at90usb1286"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 128KB Flash, 64-pin, USB Controller</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=AT90USB1286"
                  title="Device page for AT90USB1286"/>
            <book name="https://www.microchip.com/wwwproducts/productds/AT90USB1286"
                  title="Datasheet"/>
         </device>
         <device Dname="AT90USB1287">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iousb1287.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/AT90USB1287.atdf"/>
                  <at:variant ordercode="standard"
                              vccmin="2.2"
                              vccmax="5.5"
                              tempmin="0"
                              tempmax="0"/>
                  <at:memory start="0x0000"
                             size="0x20000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1fc00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1f800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1f000"
                             size="0x1000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory start="0x1e000"
                             size="0x2000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x100"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x2000"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory name="XRAM"
                             start="0x2200"
                             size="0xde00"
                             type="ram"
                             external="true"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x1000"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x08"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="megajtag" name="JTAG"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.megadfu"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="at90usb1287"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 128KB Flash, 64-pin, USB Controller</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=AT90USB1287"
                  title="Device page for AT90USB1287"/>
            <book name="https://www.microchip.com/wwwproducts/productds/AT90USB1287"
                  title="Datasheet"/>
         </device>
