piconomix/px-fwlib/libs/ATmega_DFP/Atmel.ATmega_DFP.pdsc
         <device Dname="ATmega169PA">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iom169pa.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega169PA.atdf"/>
                  <at:variant ordercode="ATmega169PA-AU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega169PA-MU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega169PA-MCH"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega169PA-AN"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="ATmega169PA-MN"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:memory start="0x0000"
                             size="0x4000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3f00"
                             size="0x0100"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3e00"
                             size="0x0200"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3c00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x0400"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0200"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x04"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="megajtag" name="JTAG"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATmega169PA"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libatmega169p.dll"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega169pa"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit picoPower AVR Microcontroller, 16KB Flash, 64-pin, LCD Controller</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega169PA"
                  title="Device page for ATmega169PA"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega169PA"
                  title="Datasheet"/>
         </device>
         <device Dname="ATmega16A">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iom16a.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega16A.atdf"/>
                  <at:variant ordercode="ATmega16A-AU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega16A-PU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega16A-MU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory start="0x0000"
                             size="0x4000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3f00"
                             size="0x0100"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3e00"
                             size="0x0200"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3c00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x0040"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0060"
                             size="0x0400"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0200"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x04"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="megajtag" name="JTAG"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATmega16A"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libatmega16a.dll"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.linux64"
                               value="simulator/linux64/libatmega16a.so"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega16a"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 16KB Flash, 40/44-pin</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega16A"
                  title="Device page for ATmega16A"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega16A"
                  title="Datasheet"/>
         </device>
         <device Dname="ATmega16HVA">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iom16hva.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega16HVA.atdf"/>
                  <at:variant ordercode="standard"
                              vccmin="1.8"
                              vccmax="4.5"
                              tempmin="0"
                              tempmax="0"/>
                  <at:memory start="0x0000"
                             size="0x4000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x0200"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0100"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x04"
                             address-space="eeprom"/>
                  <at:interface type="hvsp" name="HVSP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="dw" name="debugWIRE"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega16hva"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Battery Management HVA Microcontroller Series with 16KB Flash, 1-2 cells in series</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega16HVA"
                  title="Device page for ATmega16HVA"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega16HVA"
                  title="Datasheet"/>
         </device>
