piconomix/px-fwlib/libs/ATmega_DFP/Atmel.ATmega_DFP.pdsc
         <device Dname="ATmega16HVB">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iom16hvb.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega16HVB.atdf"/>
                  <at:variant ordercode="standard"
                              vccmin="3.0"
                              vccmax="4.5"
                              tempmin="0"
                              tempmax="0"/>
                  <at:memory start="0x0000"
                             size="0x4000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3e00"
                             size="0x0200"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3c00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3000"
                             size="0x1000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x0400"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0200"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x04"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="dw" name="debugWIRE"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATmega16HVB"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libatmega32hvb.dll"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.linux64"
                               value="simulator/linux64/libatmega32hvb.so"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega16hvb"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Battery Management HVB Microcontroller Series with 16KB Flash, 2-4 cells in series</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega16HVB"
                  title="Device page for ATmega16HVB"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega16HVB"
                  title="Datasheet"/>
         </device>
         <device Dname="ATmega16HVBrevB">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iom16hvbrevb.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega16HVBrevB.atdf"/>
                  <at:variant ordercode="standard"
                              vccmin="3.0"
                              vccmax="4.5"
                              tempmin="0"
                              tempmax="0"/>
                  <at:memory start="0x0000"
                             size="0x4000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3e00"
                             size="0x0200"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3c00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3000"
                             size="0x1000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x0400"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0200"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x04"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="dw" name="debugWIRE"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega16hvbrevb"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega16HVBrevB"
                  title="Device page for ATmega16HVBrevB"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega16HVBrevB"
                  title="Datasheet"/>
         </device>
         <device Dname="ATmega16M1">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iom16m1.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega16M1.atdf"/>
                  <at:variant ordercode="ATmega16M1-AU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega16M1-MU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory start="0x0000"
                             size="0x4000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3e00"
                             size="0x0200"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3c00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x3000"
                             size="0x1000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x0400"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0200"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x04"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="dw" name="debugWIRE"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega16m1"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 16KB Flash, 32-pin, LIN and CAN Controller</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega16M1"
                  title="Device page for ATmega16M1"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega16M1"
                  title="Datasheet"/>
         </device>
