piconomix/px-fwlib/libs/ATmega_DFP/Atmel.ATmega_DFP.pdsc
         <device Dname="ATmega3209">
            <processor Dcore="AVR8X"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iom3209.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega3209.atdf"/>
                  <at:variant ordercode="ATmega3209-AFR"
                              vccmin="1.8"
                              vccmax="5.0"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="ATmega3209-MFR"
                              vccmin="1.8"
                              vccmax="5.0"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:memory exec="0"
                             name="EEPROM"
                             pagesize="0x40"
                             rw="RW"
                             size="0x0100"
                             start="0x00001400"
                             type="eeprom"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="FUSES"
                             pagesize="0x40"
                             rw="RW"
                             size="0xA"
                             start="0x00001280"
                             type="fuses"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="INTERNAL_SRAM"
                             rw="RW"
                             size="0x1000"
                             start="0x3000"
                             type="ram"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="IO"
                             rw="RW"
                             size="0x1100"
                             start="0x00000000"
                             type="io"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="LOCKBITS"
                             pagesize="0x40"
                             rw="RW"
                             size="0x1"
                             start="0x0000128A"
                             type="lockbits"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="MAPPED_PROGMEM"
                             pagesize="0x80"
                             rw="RW"
                             size="0x8000"
                             start="0x00004000"
                             type="other"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="PROD_SIGNATURES"
                             pagesize="0x80"
                             rw="R"
                             size="0x7D"
                             start="0x00001103"
                             type="signatures"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="SIGNATURES"
                             pagesize="0x80"
                             rw="R"
                             size="0x3"
                             start="0x00001100"
                             type="signatures"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="USER_SIGNATURES"
                             pagesize="0x40"
                             rw="RW"
                             size="0x40"
                             start="0x00001300"
                             type="user_signatures"
                             address-space="data"/>
                  <at:memory exec="1"
                             name="PROGMEM"
                             pagesize="0x80"
                             rw="RW"
                             size="0x8000"
                             start="0x00000000"
                             type="flash"
                             address-space="prog"/>
                  <at:interface type="updi" name="UPDI"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATmega3209"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libattinyxe.dll"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.linux64"
                               value="simulator/linux64/libattinyxe.so"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega3209"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="studio" component="Atmel Studio" version="7.0.1585"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega3209"
                  title="Device page for ATmega3209"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega3209"
                  title="Datasheet"/>
         </device>
         <device Dname="ATmega324A">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iom324a.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega324A.atdf"/>
                  <at:variant ordercode="ATmega324A-AU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega324A-PU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega324A-MU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega324A-MCH"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega324A-CU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory start="0x0000"
                             size="0x8000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x7e00"
                             size="0x0200"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x7c00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x7800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory start="0x7000"
                             size="0x1000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x0800"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0400"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x04"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="megajtag" name="JTAG"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATmega324A"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libatmega324p.dll"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega324a"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 32KB Flash, 40/44/49-pin</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega324A"
                  title="Device page for ATmega324A"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega324A"
                  title="Datasheet"/>
         </device>
