piconomix/px-fwlib/libs/ATmega_DFP/Atmel.ATmega_DFP.pdsc
         <device Dname="ATmega88P">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iom88p.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega88P.atdf"/>
                  <at:variant ordercode="ATmega88PV-10AU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega88PV-10MU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega88PV-10PU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega88P-20AU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega88P-20MU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega88P-20PU"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory start="0x0000"
                             size="0x2000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1f00"
                             size="0x0100"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1e00"
                             size="0x0200"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1c00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x0400"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0200"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x04"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="dw" name="debugWIRE"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATmega88P"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libatmega168p.dll"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.linux64"
                               value="simulator/linux64/libatmega168p.so"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega88p"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit picoPower AVR Microcontroller, 8KB Flash, 28/32-pin</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega88P"
                  title="Device page for ATmega88P"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega88P"
                  title="Datasheet"/>
         </device>
         <device Dname="ATmega88PA">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iom88pa.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega88PA.atdf"/>
                  <at:variant ordercode="ATmega88PA-AU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega88PA-CCU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega88PA-MMH"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega88PA-MU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega88PA-PU"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATmega88PA-AN"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="ATmega88PA-MMN"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="ATmega88PA-MN"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="ATmega88PA-PN"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:memory start="0x0000"
                             size="0x2000"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1f00"
                             size="0x0100"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_1"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1e00"
                             size="0x0200"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_2"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1c00"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_3"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory start="0x1800"
                             size="0x0800"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="BOOT_SECTION_4"
                             pagesize="0x40"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x00e0"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:memory name="IRAM"
                             start="0x0100"
                             size="0x0400"
                             type="ram"
                             external="false"
                             address-space="data"/>
                  <at:memory start="0x0000"
                             size="0x0200"
                             type="eeprom"
                             rw="RW"
                             exec="0"
                             name="EEPROM"
                             pagesize="0x04"
                             address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="dw" name="debugWIRE"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATmega88PA"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libatmega168p.dll"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.linux64"
                               value="simulator/linux64/libatmega168p.so"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega88pa"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:xc8 name="xc8"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit picoPower AVR Microcontroller, 8KB Flash, 28/32-pin</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega88PA"
                  title="Device page for ATmega88PA"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega88PA"
                  title="Datasheet"/>
         </device>
