piconomix/px-fwlib/libs/ATmega_DFP/Atmel.ATmega_DFP.pdsc
      <condition id="AT90PWM1">
         <require Dvendor="Atmel:3" Dname="AT90PWM1"/>
      </condition>
      <condition id="AT90PWM161">
         <require Dvendor="Atmel:3" Dname="AT90PWM161"/>
      </condition>
      <condition id="AT90PWM216">
         <require Dvendor="Atmel:3" Dname="AT90PWM216"/>
      </condition>
      <condition id="AT90PWM2B">
         <require Dvendor="Atmel:3" Dname="AT90PWM2B"/>
      </condition>
      <condition id="AT90PWM316">
         <require Dvendor="Atmel:3" Dname="AT90PWM316"/>
      </condition>
      <condition id="AT90PWM3B">
         <require Dvendor="Atmel:3" Dname="AT90PWM3B"/>
      </condition>
      <condition id="AT90PWM81">
         <require Dvendor="Atmel:3" Dname="AT90PWM81"/>
      </condition>
      <condition id="AT90USB1286">
         <require Dvendor="Atmel:3" Dname="AT90USB1286"/>
      </condition>
      <condition id="AT90USB1287">
         <require Dvendor="Atmel:3" Dname="AT90USB1287"/>
      </condition>
      <condition id="AT90USB162">
         <require Dvendor="Atmel:3" Dname="AT90USB162"/>
      </condition>
      <condition id="AT90USB646">
         <require Dvendor="Atmel:3" Dname="AT90USB646"/>
      </condition>
      <condition id="AT90USB647">
         <require Dvendor="Atmel:3" Dname="AT90USB647"/>
      </condition>
      <condition id="AT90USB82">
         <require Dvendor="Atmel:3" Dname="AT90USB82"/>
      </condition>
      <condition id="ATmega128">
         <require Dvendor="Atmel:3" Dname="ATmega128"/>
      </condition>
      <condition id="ATmega1280">
         <require Dvendor="Atmel:3" Dname="ATmega1280"/>
      </condition>
      <condition id="ATmega1281">
         <require Dvendor="Atmel:3" Dname="ATmega1281"/>
      </condition>
      <condition id="ATmega1284">
         <require Dvendor="Atmel:3" Dname="ATmega1284"/>
      </condition>
      <condition id="ATmega1284P">
         <require Dvendor="Atmel:3" Dname="ATmega1284P"/>
      </condition>
      <condition id="ATmega1284RFR2">
         <require Dvendor="Atmel:3" Dname="ATmega1284RFR2"/>
      </condition>
      <condition id="ATmega128A">
         <require Dvendor="Atmel:3" Dname="ATmega128A"/>
      </condition>
      <condition id="ATmega128RFA1">
         <require Dvendor="Atmel:3" Dname="ATmega128RFA1"/>
      </condition>
      <condition id="ATmega128RFR2">
         <require Dvendor="Atmel:3" Dname="ATmega128RFR2"/>
      </condition>
      <condition id="ATmega16">
         <require Dvendor="Atmel:3" Dname="ATmega16"/>
      </condition>
      <condition id="ATmega1608">
         <require Dvendor="Atmel:3" Dname="ATmega1608"/>
      </condition>
      <condition id="ATmega1609">
         <require Dvendor="Atmel:3" Dname="ATmega1609"/>
      </condition>
      <condition id="ATmega162">
         <require Dvendor="Atmel:3" Dname="ATmega162"/>
      </condition>
      <condition id="ATmega164A">
         <require Dvendor="Atmel:3" Dname="ATmega164A"/>
      </condition>
      <condition id="ATmega164P">
         <require Dvendor="Atmel:3" Dname="ATmega164P"/>
      </condition>
      <condition id="ATmega164PA">
         <require Dvendor="Atmel:3" Dname="ATmega164PA"/>
      </condition>
      <condition id="ATmega165A">
         <require Dvendor="Atmel:3" Dname="ATmega165A"/>
      </condition>
      <condition id="ATmega165P">
         <require Dvendor="Atmel:3" Dname="ATmega165P"/>
      </condition>
      <condition id="ATmega165PA">
         <require Dvendor="Atmel:3" Dname="ATmega165PA"/>
      </condition>
      <condition id="ATmega168">
         <require Dvendor="Atmel:3" Dname="ATmega168"/>
      </condition>
      <condition id="ATmega168A">
         <require Dvendor="Atmel:3" Dname="ATmega168A"/>
      </condition>
      <condition id="ATmega168P">
         <require Dvendor="Atmel:3" Dname="ATmega168P"/>
      </condition>
      <condition id="ATmega168PA">
         <require Dvendor="Atmel:3" Dname="ATmega168PA"/>
      </condition>
      <condition id="ATmega168PB">
         <require Dvendor="Atmel:3" Dname="ATmega168PB"/>
      </condition>
      <condition id="ATmega169A">
         <require Dvendor="Atmel:3" Dname="ATmega169A"/>
      </condition>
      <condition id="ATmega169P">
         <require Dvendor="Atmel:3" Dname="ATmega169P"/>
      </condition>
      <condition id="ATmega169PA">
         <require Dvendor="Atmel:3" Dname="ATmega169PA"/>
      </condition>
      <condition id="ATmega16A">
         <require Dvendor="Atmel:3" Dname="ATmega16A"/>
      </condition>
      <condition id="ATmega16HVA">
         <require Dvendor="Atmel:3" Dname="ATmega16HVA"/>
      </condition>
      <condition id="ATmega16HVB">
         <require Dvendor="Atmel:3" Dname="ATmega16HVB"/>
      </condition>
      <condition id="ATmega16HVBrevB">
         <require Dvendor="Atmel:3" Dname="ATmega16HVBrevB"/>
      </condition>
      <condition id="ATmega16M1">
         <require Dvendor="Atmel:3" Dname="ATmega16M1"/>
      </condition>
      <condition id="ATmega16U2">
         <require Dvendor="Atmel:3" Dname="ATmega16U2"/>
      </condition>
      <condition id="ATmega16U4">
         <require Dvendor="Atmel:3" Dname="ATmega16U4"/>
      </condition>
      <condition id="ATmega2560">
         <require Dvendor="Atmel:3" Dname="ATmega2560"/>
      </condition>
      <condition id="ATmega2561">
         <require Dvendor="Atmel:3" Dname="ATmega2561"/>
      </condition>
      <condition id="ATmega2564RFR2">
         <require Dvendor="Atmel:3" Dname="ATmega2564RFR2"/>
      </condition>
      <condition id="ATmega256RFR2">
         <require Dvendor="Atmel:3" Dname="ATmega256RFR2"/>
      </condition>
      <condition id="ATmega32">
         <require Dvendor="Atmel:3" Dname="ATmega32"/>
      </condition>
      <condition id="ATmega3208">
         <require Dvendor="Atmel:3" Dname="ATmega3208"/>
      </condition>
      <condition id="ATmega3209">
         <require Dvendor="Atmel:3" Dname="ATmega3209"/>
      </condition>
      <condition id="ATmega324A">
         <require Dvendor="Atmel:3" Dname="ATmega324A"/>
      </condition>
      <condition id="ATmega324P">
         <require Dvendor="Atmel:3" Dname="ATmega324P"/>
      </condition>
      <condition id="ATmega324PA">
         <require Dvendor="Atmel:3" Dname="ATmega324PA"/>
      </condition>
