piconomix/px-fwlib/libs/ATmega_DFP/Atmel.ATmega_DFP.pdsc
      <condition id="ATmega324PB">
         <require Dvendor="Atmel:3" Dname="ATmega324PB"/>
      </condition>
      <condition id="ATmega325">
         <require Dvendor="Atmel:3" Dname="ATmega325"/>
      </condition>
      <condition id="ATmega3250">
         <require Dvendor="Atmel:3" Dname="ATmega3250"/>
      </condition>
      <condition id="ATmega3250A">
         <require Dvendor="Atmel:3" Dname="ATmega3250A"/>
      </condition>
      <condition id="ATmega3250P">
         <require Dvendor="Atmel:3" Dname="ATmega3250P"/>
      </condition>
      <condition id="ATmega3250PA">
         <require Dvendor="Atmel:3" Dname="ATmega3250PA"/>
      </condition>
      <condition id="ATmega325A">
         <require Dvendor="Atmel:3" Dname="ATmega325A"/>
      </condition>
      <condition id="ATmega325P">
         <require Dvendor="Atmel:3" Dname="ATmega325P"/>
      </condition>
      <condition id="ATmega325PA">
         <require Dvendor="Atmel:3" Dname="ATmega325PA"/>
      </condition>
      <condition id="ATmega328">
         <require Dvendor="Atmel:3" Dname="ATmega328"/>
      </condition>
      <condition id="ATmega328P">
         <require Dvendor="Atmel:3" Dname="ATmega328P"/>
      </condition>
      <condition id="ATmega328PB">
         <require Dvendor="Atmel:3" Dname="ATmega328PB"/>
      </condition>
      <condition id="ATmega329">
         <require Dvendor="Atmel:3" Dname="ATmega329"/>
      </condition>
      <condition id="ATmega3290">
         <require Dvendor="Atmel:3" Dname="ATmega3290"/>
      </condition>
      <condition id="ATmega3290A">
         <require Dvendor="Atmel:3" Dname="ATmega3290A"/>
      </condition>
      <condition id="ATmega3290P">
         <require Dvendor="Atmel:3" Dname="ATmega3290P"/>
      </condition>
      <condition id="ATmega3290PA">
         <require Dvendor="Atmel:3" Dname="ATmega3290PA"/>
      </condition>
      <condition id="ATmega329A">
         <require Dvendor="Atmel:3" Dname="ATmega329A"/>
      </condition>
      <condition id="ATmega329P">
         <require Dvendor="Atmel:3" Dname="ATmega329P"/>
      </condition>
      <condition id="ATmega329PA">
         <require Dvendor="Atmel:3" Dname="ATmega329PA"/>
      </condition>
      <condition id="ATmega32A">
         <require Dvendor="Atmel:3" Dname="ATmega32A"/>
      </condition>
      <condition id="ATmega32C1">
         <require Dvendor="Atmel:3" Dname="ATmega32C1"/>
      </condition>
      <condition id="ATmega32HVB">
         <require Dvendor="Atmel:3" Dname="ATmega32HVB"/>
      </condition>
      <condition id="ATmega32HVBrevB">
         <require Dvendor="Atmel:3" Dname="ATmega32HVBrevB"/>
      </condition>
      <condition id="ATmega32M1">
         <require Dvendor="Atmel:3" Dname="ATmega32M1"/>
      </condition>
      <condition id="ATmega32U2">
         <require Dvendor="Atmel:3" Dname="ATmega32U2"/>
      </condition>
      <condition id="ATmega32U4">
         <require Dvendor="Atmel:3" Dname="ATmega32U4"/>
      </condition>
      <condition id="ATmega406">
         <require Dvendor="Atmel:3" Dname="ATmega406"/>
      </condition>
      <condition id="ATmega48">
         <require Dvendor="Atmel:3" Dname="ATmega48"/>
      </condition>
      <condition id="ATmega4808">
         <require Dvendor="Atmel:3" Dname="ATmega4808"/>
      </condition>
      <condition id="ATmega4809">
         <require Dvendor="Atmel:3" Dname="ATmega4809"/>
      </condition>
      <condition id="ATmega48A">
         <require Dvendor="Atmel:3" Dname="ATmega48A"/>
      </condition>
      <condition id="ATmega48P">
         <require Dvendor="Atmel:3" Dname="ATmega48P"/>
      </condition>
      <condition id="ATmega48PA">
         <require Dvendor="Atmel:3" Dname="ATmega48PA"/>
      </condition>
      <condition id="ATmega48PB">
         <require Dvendor="Atmel:3" Dname="ATmega48PB"/>
      </condition>
      <condition id="ATmega64">
         <require Dvendor="Atmel:3" Dname="ATmega64"/>
      </condition>
      <condition id="ATmega640">
         <require Dvendor="Atmel:3" Dname="ATmega640"/>
      </condition>
      <condition id="ATmega644">
         <require Dvendor="Atmel:3" Dname="ATmega644"/>
      </condition>
      <condition id="ATmega644A">
         <require Dvendor="Atmel:3" Dname="ATmega644A"/>
      </condition>
      <condition id="ATmega644P">
         <require Dvendor="Atmel:3" Dname="ATmega644P"/>
      </condition>
      <condition id="ATmega644PA">
         <require Dvendor="Atmel:3" Dname="ATmega644PA"/>
      </condition>
      <condition id="ATmega644RFR2">
         <require Dvendor="Atmel:3" Dname="ATmega644RFR2"/>
      </condition>
      <condition id="ATmega645">
         <require Dvendor="Atmel:3" Dname="ATmega645"/>
      </condition>
      <condition id="ATmega6450">
         <require Dvendor="Atmel:3" Dname="ATmega6450"/>
      </condition>
      <condition id="ATmega6450A">
         <require Dvendor="Atmel:3" Dname="ATmega6450A"/>
      </condition>
      <condition id="ATmega6450P">
         <require Dvendor="Atmel:3" Dname="ATmega6450P"/>
      </condition>
      <condition id="ATmega645A">
         <require Dvendor="Atmel:3" Dname="ATmega645A"/>
      </condition>
      <condition id="ATmega645P">
         <require Dvendor="Atmel:3" Dname="ATmega645P"/>
      </condition>
      <condition id="ATmega649">
         <require Dvendor="Atmel:3" Dname="ATmega649"/>
      </condition>
      <condition id="ATmega6490">
         <require Dvendor="Atmel:3" Dname="ATmega6490"/>
      </condition>
      <condition id="ATmega6490A">
         <require Dvendor="Atmel:3" Dname="ATmega6490A"/>
      </condition>
      <condition id="ATmega6490P">
         <require Dvendor="Atmel:3" Dname="ATmega6490P"/>
      </condition>
      <condition id="ATmega649A">
         <require Dvendor="Atmel:3" Dname="ATmega649A"/>
      </condition>
      <condition id="ATmega649P">
         <require Dvendor="Atmel:3" Dname="ATmega649P"/>
      </condition>
      <condition id="ATmega64A">
         <require Dvendor="Atmel:3" Dname="ATmega64A"/>
      </condition>
      <condition id="ATmega64C1">
         <require Dvendor="Atmel:3" Dname="ATmega64C1"/>
      </condition>
      <condition id="ATmega64HVE2">
         <require Dvendor="Atmel:3" Dname="ATmega64HVE2"/>
      </condition>
